
*** install nvidia toolkit
see https://askubuntu.com/questions/128524/how-to-list-dependent-packages-reverse-dependencies for rdepends keyword
#+begin_src bash
apt-cache rdepends packagename nvidia-cuda-toolkit
#+end_src

#+RESULTS:
| nvidia-cuda-toolkit     |          |
| Reverse                 | Depends: |
| nvidia-cuda-toolkit-gcc |          |
| python3-pycuda          |          |
| nvidia-profiler         |          |
| hxtools                 |          |
| libthrust-dev           |          |
| python3-theano          |          |
| python3-numba           |          |
| nvptx-tools             |          |


#+begin_src  bash :results output raw
 sudo  apt install -y nvidia-cuda-toolkit
#+end_src


#+RESULTS:
sudo  apt install -y nvidia-cuda-toolkit
Reading package lists... Done
Building dependency tree
Reading state information... Done
The following additional packages will be installed:
  cpp-8 g++-8 gcc-8 gcc-8-base libaccinj64-10.1 libcublas10 libcublaslt10 libcudart10.1 libcufft10 libcufftw10 libcuinj64-10.1 libcupti-dev libcupti-doc libcupti10.1 libcurand10 libcusolver10
  libcusolvermg10 libcusparse10 libgcc-8-dev libmpx2 libncurses5 libnppc10 libnppial10 libnppicc10 libnppicom10 libnppidei10 libnppif10 libnppig10 libnppim10 libnppist10 libnppisu10 libnppitc10
  libnpps10 libnvblas10 libnvgraph10 libnvidia-ml-dev libnvjpeg10 libnvrtc10.1 libnvtoolsext1 libnvvm3 libstdc++-8-dev libthrust-dev libtinfo5 libvdpau-dev node-html5shiv nsight-compute nsight-systems
  nvidia-cuda-dev nvidia-cuda-doc nvidia-cuda-gdb nvidia-opencl-dev nvidia-profiler nvidia-visual-profiler ocl-icd-opencl-dev opencl-c-headers openjdk-8-jre openjdk-8-jre-headless
Suggested packages:
  gcc-8-locales g++-8-multilib gcc-8-doc gcc-8-multilib libstdc++-8-doc libvdpau-doc nodejs nvidia-driver | nvidia-tesla-440-driver | nvidia-tesla-418-driver libpoclu-dev fonts-ipafont-gothic
  fonts-ipafont-mincho fonts-wqy-microhei fonts-wqy-zenhei
Recommended packages:
  libnvcuvid1
The following NEW packages will be installed:
  cpp-8 g++-8 gcc-8 gcc-8-base libaccinj64-10.1 libcublas10 libcublaslt10 libcudart10.1 libcufft10 libcufftw10 libcuinj64-10.1 libcupti-dev libcupti-doc libcupti10.1 libcurand10 libcusolver10
  libcusolvermg10 libcusparse10 libgcc-8-dev libmpx2 libncurses5 libnppc10 libnppial10 libnppicc10 libnppicom10 libnppidei10 libnppif10 libnppig10 libnppim10 libnppist10 libnppisu10 libnppitc10
  libnpps10 libnvblas10 libnvgraph10 libnvidia-ml-dev libnvjpeg10 libnvrtc10.1 libnvtoolsext1 libnvvm3 libstdc++-8-dev libthrust-dev libtinfo5 libvdpau-dev node-html5shiv nsight-compute nsight-systems
  nvidia-cuda-dev nvidia-cuda-doc nvidia-cuda-gdb nvidia-cuda-toolkit nvidia-opencl-dev nvidia-profiler nvidia-visual-profiler ocl-icd-opencl-dev opencl-c-headers openjdk-8-jre openjdk-8-jre-headless
0 upgraded, 58 newly installed, 0 to remove and 15 not upgraded.
Need to get 1.355 MB/1.428 MB of archives.
After this operation, 3.819 MB of additional disk space will be used.


*** Check cuda version

#+begin_src  bash :results output pp
nvcc --version
#+end_src

#+RESULTS:
: nvcc: NVIDIA (R) Cuda compiler driver
: Copyright (c) 2005-2019 NVIDIA Corporation
: Built on Sun_Jul_28_19:07:16_PDT_2019
: Cuda compilation tools, release 10.1, V10.1.243

see
https://linuxconfig.org/how-to-install-cuda-on-ubuntu-20-04-focal-fossa-linux


**** Libri and vctk dev and test sets

- local/download_data is a paraemetrized script that does ftp access and download:
- File: baseline/config.sh contains the below configurations:

#+begin_src shell
  ##########################################################
  # Evaluation data sets
  eval_sets='libri vctk'
  eval_subsets='dev test'

  for dset in $eval_sets ; do
    for suff in $eval_subsets; do
        echo "${dset}_${suff}.tar.gz"
        tar -ztvf baseline/${dset}_${suff}.tar.gz  | head -n 15
    done
  done

#+end_src

#+RESULTS:
| libri_dev.tar.gz  |                      |        |            |       |                                                          |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-06 | 22:03 | data/                                                    |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-06 | 22:02 | data/libri_dev/                                          |
| -rw-r-----        | ntomashenko/laboinfo |  49305 | 2020-02-06 | 22:01 | data/libri_dev/utt2spk                                   |
| -rw-r-----        | ntomashenko/laboinfo | 671086 | 2014-08-17 | 08:45 | data/libri_dev/CHAPTERS.TXT                              |
| -rw-r-----        | ntomashenko/laboinfo |   5614 | 2020-02-06 | 21:32 | data/libri_dev/enrolls                                   |
| -rw-r-----        | ntomashenko/laboinfo | 115746 | 2014-10-03 | 13:15 | data/libri_dev/BOOKS.TXT                                 |
| -rw-r-----        | ntomashenko/laboinfo | 478297 | 2020-02-04 | 19:57 | data/libri_dev/trials_f                                  |
| -rw-r-----        | ntomashenko/laboinfo |    273 | 2020-02-06 | 22:01 | data/libri_dev/spk2gender                                |
| -rw-r-----        | ntomashenko/laboinfo |   8039 | 2014-10-03 | 13:12 | data/libri_dev/README.TXT                                |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-06 | 21:47 | data/libri_dev/wav/                                      |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-06 | 21:47 | data/libri_dev/wav/84-121123-0022/                       |
| -rw-r-----        | ntomashenko/laboinfo |  83564 | 2020-02-06 | 21:47 | data/libri_dev/wav/84-121123-0022/84-121123-0022.wav     |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-06 | 21:45 | data/libri_dev/wav/2078-142845-0008/                     |
| -rw-r-----        | ntomashenko/laboinfo | 620204 | 2020-02-06 | 21:45 | data/libri_dev/wav/2078-142845-0008/2078-142845-0008.wav |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-06 | 21:46 | data/libri_dev/wav/6313-66125-0023/                      |
| libri_test.tar.gz |                      |        |            |       |                                                          |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-16 | 17:18 | data/libri_test/                                         |
| -rw-r-----        | ntomashenko/laboinfo |  54512 | 2020-02-16 | 17:18 | data/libri_test/utt2spk                                  |
| -rw-r-----        | ntomashenko/laboinfo | 671086 | 2014-08-17 | 08:45 | data/libri_test/CHAPTERS.TXT                             |
| -rw-r-----        | ntomashenko/laboinfo |   6951 | 2020-02-15 | 20:57 | data/libri_test/enrolls                                  |
| -rw-r-----        | ntomashenko/laboinfo | 115746 | 2014-10-03 | 13:15 | data/libri_test/BOOKS.TXT                                |
| -rw-r-----        | ntomashenko/laboinfo | 361032 | 2020-02-15 | 21:05 | data/libri_test/trials_f                                 |
| -rw-r-----        | ntomashenko/laboinfo |    273 | 2020-02-16 | 17:18 | data/libri_test/spk2gender                               |
| -rw-r-----        | ntomashenko/laboinfo |   8039 | 2014-10-03 | 13:12 | data/libri_test/README.TXT                               |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-15 | 20:50 | data/libri_test/wav/                                     |
| -rw-r-----        | ntomashenko/laboinfo | 520364 | 2020-02-15 | 20:49 | data/libri_test/wav/2094-142345-0011.wav                 |
| -rw-r-----        | ntomashenko/laboinfo | 627564 | 2020-02-15 | 20:50 | data/libri_test/wav/4077-13751-0005.wav                  |
| -rw-r-----        | ntomashenko/laboinfo | 105804 | 2020-02-15 | 20:50 | data/libri_test/wav/6930-81414-0002.wav                  |
| -rw-r-----        | ntomashenko/laboinfo | 285804 | 2020-02-15 | 20:50 | data/libri_test/wav/7729-102255-0019.wav                 |
| -rw-r-----        | ntomashenko/laboinfo | 327724 | 2020-02-15 | 20:50 | data/libri_test/wav/908-157963-0021.wav                  |
| -rw-r-----        | ntomashenko/laboinfo |  62604 | 2020-02-15 | 20:49 | data/libri_test/wav/1995-1837-0008.wav                   |
| vctk_dev.tar.gz   |                      |        |            |       |                                                          |
| drwxrwxr-x        | 1002/ntomashenko     |      0 | 2020-02-05 | 21:24 | data/                                                    |
| drwxr-x---        | 1002/ntomashenko     |      0 | 2020-02-02 | 17:52 | data/vctk_dev/                                           |
| -rw-r-----        | 1002/ntomashenko     | 232807 | 2020-01-26 | 23:20 | data/vctk_dev/utt2spk                                    |
| -rw-r-----        | 1002/ntomashenko     |  17416 | 2019-12-10 | 14:33 | data/vctk_dev/license_text                               |
| -rw-r-----        | 1002/ntomashenko     |    425 | 2020-02-02 | 17:47 | data/vctk_dev/README_vctk_dev.txt                        |
| -rw-r-----        | 1002/ntomashenko     | 151545 | 2020-02-05 | 19:32 | data/vctk_dev/trials_m_common_mic2                       |
| -rw-r-----        | 1002/ntomashenko     | 429657 | 2020-02-05 | 19:32 | data/vctk_dev/trials_f_mic2                              |
| -rw-r-----        | 1002/ntomashenko     | 288392 | 2020-01-26 | 23:20 | data/vctk_dev/utt2dur                                    |
| -rw-r-----        | 1002/ntomashenko     |    240 | 2019-12-27 | 19:26 | data/vctk_dev/utt2num_mic2.ark                           |
| -rw-r-----        | 1002/ntomashenko     | 676506 | 2020-01-26 | 23:20 | data/vctk_dev/text                                       |
| -rw-r-----        | 1002/ntomashenko     | 171692 | 2020-01-26 | 23:20 | data/vctk_dev/spk2utt                                    |
| -rw-r-----        | 1002/ntomashenko     |    210 | 2020-01-26 | 23:20 | data/vctk_dev/spk2gender                                 |
| -rw-r-----        | 1002/ntomashenko     | 148434 | 2020-02-05 | 19:32 | data/vctk_dev/trials_f_common_mic2                       |
| -rw-r-----        | 1002/ntomashenko     |   8400 | 2020-02-05 | 19:31 | data/vctk_dev/enrolls_mic2                               |
| -rw-r-----        | 1002/ntomashenko     |   5236 | 2019-12-10 | 14:33 | data/vctk_dev/README.txt                                 |
| vctk_test.tar.gz  |                      |        |            |       |                                                          |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-16 | 01:13 | data/vctk_test/                                          |
| -rw-r-----        | ntomashenko/laboinfo | 152812 | 2020-02-05 | 19:32 | data/vctk_test/trials_m_common_mic2                      |
| -rw-r-----        | ntomashenko/laboinfo | 234650 | 2020-02-15 | 23:31 | data/vctk_test/utt2spk                                   |
| -rw-r-----        | ntomashenko/laboinfo |   5236 | 2019-12-10 | 14:33 | data/vctk_test/README.txt                                |
| -rw-r-----        | ntomashenko/laboinfo | 149298 | 2020-02-05 | 19:32 | data/vctk_test/trials_f_common_mic2                      |
| -rw-r-----        | ntomashenko/laboinfo |   8400 | 2020-02-05 | 19:31 | data/vctk_test/enrolls_mic2                              |
| -rw-r-----        | ntomashenko/laboinfo |    486 | 2020-02-16 | 01:13 | data/vctk_test/README_vctk_test.txt                      |
| -rw-r-----        | ntomashenko/laboinfo | 429168 | 2020-02-05 | 19:32 | data/vctk_test/trials_f_mic2                             |
| -rw-r-----        | ntomashenko/laboinfo |    210 | 2020-02-15 | 23:31 | data/vctk_test/spk2gender                                |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-02-15 | 18:58 | data/vctk_test/wav/                                      |
| drwxr-x---        | ntomashenko/laboinfo |      0 | 2020-01-27 | 02:27 | data/vctk_test/wav/p270/                                 |
| -rw-r-----        | ntomashenko/laboinfo |  63108 | 2020-01-27 | 02:26 | data/vctk_test/wav/p270/p270_382_mic2.wav                |
| -rw-r-----        | ntomashenko/laboinfo | 108062 | 2020-01-27 | 02:26 | data/vctk_test/wav/p270/p270_384_mic2.wav                |
| -rw-r-----        | ntomashenko/laboinfo | 126236 | 2020-01-27 | 02:26 | data/vctk_test/wav/p270/p270_329_mic2.wav                |
| -rw-r-----        | ntomashenko/laboinfo | 103800 | 2020-01-27 | 02:26 | data/vctk_test/wav/p270/p270_100_mic2.wav                |







**** train-clean-360-spk

- the data directory contains metadata to link speakers to sex and utterances to speaker


#+begin_src bash :results output pp
ls baseline -lt
#+end_src

#+RESULTS:
#+begin_example
total 1090736
-rw-r--r--  1 cgeng domain users 177192960 Feb  5 19:08 vctk_dev.tar.gz
-rw-r--r--  1 cgeng domain users 510067307 Feb  5 19:07 libri_test.tar.gz
-rw-r--r--  1 cgeng domain users 429558361 Feb  5 19:02 libri_dev.tar.gz
drwxr-xr-x  2 cgeng domain users      4096 Feb  3 16:35 corpora
-rwxr-xr-x  1 cgeng domain users      5993 Feb  1 12:37 run.sh
-rwxr-xr-x  1 cgeng domain users      2622 Feb  1 12:37 run_tts_train.sh
-rwxr-xr-x  1 cgeng domain users      5834 Feb  1 12:37 run_xvector.sh
lrwxrwxrwx  1 cgeng domain users        25 Feb  1 12:37 sid -> ../kaldi/egs/sre08/v1/sid
lrwxrwxrwx  1 cgeng domain users        25 Feb  1 12:37 steps -> ../kaldi/egs/wsj/s5/steps
lrwxrwxrwx  1 cgeng domain users        25 Feb  1 12:37 utils -> ../kaldi/egs/wsj/s5/utils
lrwxrwxrwx  1 cgeng domain users        33 Feb  1 12:37 local_librispeech -> ../kaldi/egs/librispeech/s5/local
-rw-r--r--  1 cgeng domain users       500 Feb  1 12:37 path.sh
-rwxr-xr-x  1 cgeng domain users     10924 Feb  1 12:37 print_config.sh
drwxr-xr-x  2 cgeng domain users      4096 Feb  1 12:37 results
drwxr-xr-x  2 cgeng domain users      4096 Feb  1 12:37 results_old
drwxr-xr-x 10 cgeng domain users      4096 Feb  1 12:37 local
drwxr-xr-x  2 cgeng domain users      4096 Feb  1 12:37 fig
drwxr-xr-x  2 cgeng domain users      4096 Feb  1 12:37 conf
-rw-r--r--  1 cgeng domain users      7818 Feb  1 12:37 config.sh
-rwxr-xr-x  1 cgeng domain users      6205 Feb  1 12:37 cleanup.sh
-rw-r--r--  1 cgeng domain users       917 Feb  1 12:37 cmd.sh
#+end_example

Get the data from compute3.

#+begin_src shell :results output pp
    mkdir -p  baseline/data/train-clean-360-spk
    # rsync -aPqi compute3:/data/work3/cgeng/Voice-Privacy-Challenge-2022/baseline/data/train-clean-360-spk/  baseline/data/train-clean-360-spk/
    ls -l  baseline/data/train-clean-360-spk/
    tar -ztvf   baseline/data/train-clean-360-spk/train-clean-360-spk.tar.gz | head -n 200
  pwd
#+end_src

#+RESULTS:
: total 228
: drwxr-x--- 2 cgeng domain users   4096 Dez 28  2021 train-clean-360-spk
: -rw-r--r-- 1 cgeng domain users 227600 Jan 26 16:14 train-clean-360-spk.tar.gz
: drwxr-x--- philou/taln       0 2021-12-28 13:04 train-clean-360-spk/
: -rw-r----- philou/taln 2199854 2021-12-28 04:52 train-clean-360-spk/utt2spk
: -rw-r----- philou/taln    6268 2021-12-28 04:52 train-clean-360-spk/spk2gender
: /home/audeering.local/cgeng/Data/Data_HDD/work/code/Voice-Privacy-Challenge-2022ap-cgeng.fritz.box


meta of speaker data:

#+begin_src shell :results output pp
head baseline/data/train-clean-360-spk/train-clean-360-spk/spk2gender
tail baseline/data/train-clean-360-spk/train-clean-360-spk/spk2gender
#+end_src

#+RESULTS:
#+begin_example
100 f
1001 m
101 m
1012 f
1018 m
1025 m
1027 m
1028 m
1031 f
1046 m
948 f
949 m
953 m
954 m
957 m
968 f
979 f
98 f
984 m
986 m
#+end_example


#+begin_src shell :results output pp
  head baseline/data/train-clean-360-spk/train-clean-360-spk/utt2spk
  tail baseline/data/train-clean-360-spk/train-clean-360-spk/utt2spk
#+end_src

#+RESULTS:
#+begin_example
100-121669-0000 100
100-121669-0001 100
100-121669-0002 100
100-121669-0003 100
100-121669-0004 100
100-121669-0005 100
100-121669-0006 100
100-121669-0007 100
100-121669-0008 100
100-121669-0009 100
986-129388-0103 986
986-129388-0104 986
986-129388-0105 986
986-129388-0106 986
986-129388-0107 986
986-129388-0108 986
986-129388-0109 986
986-129388-0110 986
986-129388-0111 986
986-129388-0112 986
#+end_example



**** Downloading F0 for train-clean-360-asv

expo=exp/am_nsf_data
mkdir -p  baseline/$expo
fname=train-clean-360-asv.tar.gz
rsync -aP compute3:/data/work3/cgeng/Voice-Privacy-Challenge-2022/baseline/$expo/$fname baseline/$expo/$fname


#+begin_src bash :results output pp
  expo=exp/am_nsf_data
  mkdir -p  baseline/$expo
  fname=train-clean-360-asv.tar.gz
  tar -ztvf   baseline/$expo/$fname | head
  ls baseline/$expo/$fname
#+end_src

#+RESULTS:
#+begin_example
drwxr-x--- philou/taln       0 2022-01-10 15:26 train-clean-360-asv/
drwxr-x--- philou/taln       0 2022-01-02 10:53 train-clean-360-asv/f0/
-rw-r----- philou/taln    3064 2022-01-02 10:29 train-clean-360-asv/f0/6993-83606-0014.f0
-rw-r----- philou/taln    5112 2022-01-02 10:43 train-clean-360-asv/f0/8176-115046-0023.f0
-rw-r----- philou/taln    5796 2022-01-02 09:28 train-clean-360-asv/f0/3717-21498-0004.f0
-rw-r----- philou/taln    6416 2022-01-02 08:58 train-clean-360-asv/f0/208-126851-0016.f0
-rw-r----- philou/taln    5808 2022-01-02 09:47 train-clean-360-asv/f0/409-124990-0032.f0
-rw-r----- philou/taln    3492 2022-01-02 09:16 train-clean-360-asv/f0/318-124224-0012.f0
-rw-r----- philou/taln    6252 2022-01-02 10:34 train-clean-360-asv/f0/7525-101265-0007.f0
-rw-r----- philou/taln    5912 2022-01-02 09:47 train-clean-360-asv/f0/409-124990-0029.f0
baseline/exp/am_nsf_data/train-clean-360-asv.tar.gz
#+end_example



***   local/download_models.sh - download pretrained models

Das models tar liegt an der falschen Stelle, ich habe es nach  baseline/exp/
verschoben und mit tar xzf models.2022.tar.gz entpackt!

expo=exp/
models=models.2022.tar.gz
rsync -aP compute3:/data/work3/cgeng/Voice-Privacy-Challenge-2022/baseline/$expo/$models baseline/$expo/$models

#+begin_src bash  : :results output pp
ls baseline/exp/models  -l
#+end_src

#+RESULTS:
#+begin_example
total 72
drwxr-x--- 4 cgeng domain users 4096 Jan 16  2020 1_asr_am
drwxr-x--- 4 cgeng domain users 4096 Jan 16  2020 2_xvect_extr
drwxr-x--- 2 cgeng domain users 4096 Dez 11  2021 2_xvect_extr_sidekit
drwxr-x--- 2 cgeng domain users 4096 Jan 21  2020 3_ss_am
drwxr-x--- 2 cgeng domain users 4096 Feb 22  2022 3_ss_am_pt
drwxr-x--- 2 cgeng domain users 4096 Feb 22  2022 3_ss_am_pt_sidekit
drwxr-x--- 2 cgeng domain users 4096 Jan 21  2020 4_nsf
drwxr-x--- 2 cgeng domain users 4096 Feb 22  2022 4_nsf_pt
drwxr-x--- 2 cgeng domain users 4096 Feb 22  2022 4_nsf_pt_sidekit
drwxr-x--- 2 cgeng domain users 4096 Feb 22  2022 5_joint_tts_hifigan
drwxr-x--- 2 cgeng domain users 4096 Feb 22  2022 5_joint_tts_hifigan_sidekit
drwxr-x--- 2 cgeng domain users 4096 Feb 22  2022 5_joint_tts_nsf_hifigan
drwxr-x--- 2 cgeng domain users 4096 Feb 22  2022 5_joint_tts_nsf_hifigan_sidekit
drwxr-x--- 9 cgeng domain users 4096 Dez 29  2021 asr_eval
drwxr-x--- 7 cgeng domain users 4096 Nov 10  2020 asr_eval_b1_anon
drwxr-x--- 3 cgeng domain users 4096 Jan 27  2020 asv_eval
drwxr-x--- 3 cgeng domain users 4096 Nov 10  2020 asv_eval_b1_anon
drwxr-x--- 2 cgeng domain users 4096 Dez 11  2021 asv_eval_sidekit
#+end_example


***** train-clean-100
part=train-clean-100
corpora=corpora
data_url_librispeech=www.openslr.org/resources/12
# das löscht den tarball:
local/download_and_untar.sh --remove-archive $corpora $data_url_librispeech $part LibriSpeech
# das löscht ihn nicht
local/download_and_untar.sh  $corpora $data_url_librispeech $part LibriSpeech

So muss das aussehen:

pwd; ls   train-other-500.tar.gz
/home/audeering.local/cgeng/Data/Data_HDD/work/code/Voice-Privacy-Challenge-2022ap-cgeng.fritz.box/baseline/corpora
train-other-500.tar.gz



#+begin_src bash :results output pp
part=train-clean-100
tar -ztvf baseline/corpora/$part.tar.gz | head -n 25
#+end_src

#+RESULTS:
#+begin_example
-rw-r--r-- vassil/vassil   193 2014-08-17 08:19 LibriSpeech/LICENSE.TXT
-rw-r--r-- vassil/vassil  8039 2014-10-03 13:12 LibriSpeech/README.TXT
-rw-r--r-- vassil/vassil 671086 2014-08-17 08:45 LibriSpeech/CHAPTERS.TXT
-rw-r--r-- vassil/vassil 125034 2014-08-17 08:45 LibriSpeech/SPEAKERS.TXT
-rw-r--r-- vassil/vassil 115746 2014-10-03 13:15 LibriSpeech/BOOKS.TXT
drwxr-xr-x vassil/vassil      0 2014-08-16 08:17 LibriSpeech/train-clean-100/
drwxr-xr-x vassil/vassil      0 2014-08-16 08:15 LibriSpeech/train-clean-100/374/
drwxr-xr-x vassil/vassil      0 2014-08-16 08:15 LibriSpeech/train-clean-100/374/180298/
-r--r--r-- vassil/vassil 228475 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0021.flac
-r--r--r-- vassil/vassil 152231 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0038.flac
-r--r--r-- vassil/vassil 260792 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0022.flac
-r--r--r-- vassil/vassil 254636 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0044.flac
-r--r--r-- vassil/vassil 225397 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0006.flac
-r--r--r-- vassil/vassil 253055 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0051.flac
-r--r--r-- vassil/vassil 150583 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0060.flac
-r--r--r-- vassil/vassil 264623 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0028.flac
-r--r--r-- vassil/vassil 187921 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0045.flac
-r--r--r-- vassil/vassil 231822 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0036.flac
-r--r--r-- vassil/vassil 224890 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0053.flac
-r--r--r-- vassil/vassil 246321 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0032.flac
-r--r--r-- vassil/vassil 290808 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0018.flac
-r--r--r-- vassil/vassil 288138 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0007.flac
-r--r--r-- vassil/vassil 178398 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0043.flac
-r--r--r-- vassil/vassil 256378 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0014.flac
-r--r--r-- vassil/vassil 237941 2014-07-08 11:13 LibriSpeech/train-clean-100/374/180298/374-180298-0049.flac
#+end_example

***** part=train-other-500

part=train-other-500
corpora=corpora
data_url_librispeech=www.openslr.org/resources/12
full_url=$data_url_librispeech/$part.tar.gz
local/download_and_untar.sh  $corpora $data_url_librispeech $part LibriSpeech


#+begin_src bash :results output pp
part=train-other-500
tar -ztvf baseline/corpora/$part.tar.gz | head
#+end_src

#+RESULTS:
#+begin_example
-rw-r--r-- vassil/vassil   193 2014-08-17 08:19 LibriSpeech/LICENSE.TXT
-rw-r--r-- vassil/vassil  8039 2014-10-03 13:12 LibriSpeech/README.TXT
-rw-r--r-- vassil/vassil 671086 2014-08-17 08:45 LibriSpeech/CHAPTERS.TXT
-rw-r--r-- vassil/vassil 125034 2014-08-17 08:45 LibriSpeech/SPEAKERS.TXT
-rw-r--r-- vassil/vassil 115746 2014-10-03 13:15 LibriSpeech/BOOKS.TXT
drwxr-xr-x vassil/vassil      0 2014-08-16 18:53 LibriSpeech/train-other-500/
drwxr-xr-x vassil/vassil      0 2014-08-16 16:26 LibriSpeech/train-other-500/8296/
drwxr-xr-x vassil/vassil      0 2014-08-16 16:26 LibriSpeech/train-other-500/8296/266250/
-r--r--r-- vassil/vassil 240201 2014-07-08 18:02 LibriSpeech/train-other-500/8296/266250/8296-266250-0012.flac
-r--r--r-- vassil/vassil 120419 2014-07-08 18:02 LibriSpeech/train-other-500/8296/266250/8296-266250-0004.flac
#+end_example











**** Zusstand daten davor:

#+begin_src bash :results output pp
ls -l ~/Data/Data_HDD/work/code/Voice-Privacy-Challenge-2022ap-cgeng.fritz.box/baseline/data/
#+end_src

#+RESULTS:
: total 4
: drwxr-xr-x 3 cgeng domain users 4096 Jan 26 16:14 train-clean-360-spk

**** Zusstand daten danach:

#+begin_src bash :results output pp
  ls -lh ~/Data/Data_HDD/work/code/Voice-Privacy-Challenge-2022ap-cgeng.fritz.box/baseline/data/
  du -mah ~/Data/Data_HDD/work/code/Voice-Privacy-Challenge-2022ap-cgeng.fritz.box/baseline/data/ --max-depth=1
#+end_src

#+RESULTS:
: total 8,0K
: drwxr-xr-x 2 cgeng domain users 4,0K Feb  6 12:09 libritts_train_other_500
: drwxr-xr-x 3 cgeng domain users 4,0K Jan 26 16:14 train-clean-360-spk
: 2,4M	/home/audeering.local/cgeng/Data/Data_HDD/work/code/Voice-Privacy-Challenge-2022ap-cgeng.fritz.box/baseline/data/train-clean-360-spk
: 70M	/home/audeering.local/cgeng/Data/Data_HDD/work/code/Voice-Privacy-Challenge-2022ap-cgeng.fritz.box/baseline/data/libritts_train_other_500
: 72M	/home/audeering.local/cgeng/Data/Data_HDD/work/code/Voice-Privacy-Challenge-2022ap-cgeng.fritz.box/baseline/data/


Was wird erzeugt?
- wav.scp: sox log
- spk2gender und utt2spk: Die Mappings
- text: asr results?
- Zum schluss:

#+begin_src bash :results output pp
  ls -lh ~/Data/Data_HDD/work/code/Voice-Privacy-Challenge-2022ap-cgeng.fritz.box/baseline/data/libritts_train_other_500
#+end_src

#+RESULTS:
: total 85M
: -rw-r--r-- 1 cgeng domain users 7,8K Feb  6 12:31 spk2gender
: -rw-r--r-- 1 cgeng domain users 5,9M Feb  6 12:31 spk2utt
: -rw-r--r-- 1 cgeng domain users  24M Feb  6 12:31 text
: -rw-r--r-- 1 cgeng domain users 6,9M Feb  6 12:31 utt2spk
: -rw-r--r-- 1 cgeng domain users  49M Feb  6 12:31 wav.scp


**** Call Stack
#+INCLUDE: "./baseline/local/main_extract_xvectors_pool.sh"
#+INCLUDE: "./baseline/local/featex/01_extract_xvectors.sh"

parse options kommt von hier:

#+begin_src bash :results output pp
find   -iname parse_options.sh
#+end_src

#+RESULTS:
: ./kaldi/egs/wsj/s5/utils/parse_options.sh

***** # xvec_nnet_dir definiert in config.sh

Content dieses xvector nnet dirs

#+begin_src bash :results output pp
xvec_nnet_dir=exp/models/2_xvect_extr/exp/xvector_nnet_1a # x-vector extractor
ls baseline/$xvec_nnet_dir/ -l
#+end_src

#+RESULTS:
#+begin_example
total 33076
-rw-r----- 1 cgeng domain users     2389 Dez  8  2019 accuracy.output.report
drwxr-x--- 2 cgeng domain users     4096 Jan 30  2020 anon
drwxr-x--- 2 cgeng domain users     4096 Dez  8  2019 configs
-rw-r----- 1 cgeng domain users       43 Dez  8  2019 extract.config
-rw-r----- 1 cgeng domain users 33086093 Dez  8  2019 final.raw
-rw-r----- 1 cgeng domain users        6 Dez  8  2019 max_chunk_size
-rw-r----- 1 cgeng domain users     5314 Dez  9  2019 mean.vec
-rw-r----- 1 cgeng domain users        3 Dez  8  2019 min_chunk_size
-rw-r----- 1 cgeng domain users     4979 Dez  8  2019 nnet.config
-rw-r----- 1 cgeng domain users   323246 Dez  9  2019 plda
-rw-r----- 1 cgeng domain users        3 Dez  8  2019 srand
-rw-r----- 1 cgeng domain users   410415 Dez  9  2019 transform.mat
#+end_example


**** 01_extract_xvectors.sh
Steps:
1. mfcc erzeugen

  #+begin_src  bash
ls /tmp/mfcc -lt
  #+end_src

  #+RESULTS:
  | total      | 6848 |       |        |       |        |     |   |       |                                         |
  | -rw-r--r-- |    1 | cgeng | domain | users | 743933 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.7.ark  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2083 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.7.scp  |
  | -rw-r--r-- |    1 | cgeng | domain | users | 780349 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.1.ark  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2107 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.1.scp  |
  | -rw-r--r-- |    1 | cgeng | domain | users | 693378 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.2.ark  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2107 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.2.scp  |
  | -rw-r--r-- |    1 | cgeng | domain | users | 679981 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.5.ark  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2088 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.5.scp  |
  | -rw-r--r-- |    1 | cgeng | domain | users | 507861 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.8.ark  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2013 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.8.scp  |
  | -rw-r--r-- |    1 | cgeng | domain | users | 571354 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.6.ark  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2063 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.6.scp  |
  | -rw-r--r-- |    1 | cgeng | domain | users | 526244 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.12.ark |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2030 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.12.scp |
  | -rw-r--r-- |    1 | cgeng | domain | users | 468868 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.9.ark  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2017 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.9.scp  |
  | -rw-r--r-- |    1 | cgeng | domain | users | 525950 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.10.ark |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2041 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.10.scp |
  | -rw-r--r-- |    1 | cgeng | domain | users | 522093 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.4.ark  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2091 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.4.scp  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2061 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.11.scp |
  | -rw-r--r-- |    1 | cgeng | domain | users | 467954 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.11.ark |
  | -rw-r--r-- |    1 | cgeng | domain | users | 450232 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.3.ark  |
  | -rw-r--r-- |    1 | cgeng | domain | users |   2107 | Feb | 7 | 16:16 | raw_mfcc_libri_dev_enrolls_cgeng.3.scp  |
2. vad erzeugen
#+begin_src  bash
ls /tmp/vad -lt
#+end_src
#+RESULTS:
| total      | 968 |       |        |       |       |     |   |       |                                    |
| -rw-r--r-- |   1 | cgeng | domain | users | 87436 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.10.ark |
| -rw-r--r-- |   1 | cgeng | domain | users |  2116 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.10.scp |
| -rw-r--r-- |   1 | cgeng | domain | users | 92594 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.1.ark  |
| -rw-r--r-- |   1 | cgeng | domain | users |  1711 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.1.scp  |
| -rw-r--r-- |   1 | cgeng | domain | users | 98079 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.2.ark  |
| -rw-r--r-- |   1 | cgeng | domain | users |  1968 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.2.scp  |
| -rw-r--r-- |   1 | cgeng | domain | users | 97589 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.5.ark  |
| -rw-r--r-- |   1 | cgeng | domain | users |  2016 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.5.scp  |
| -rw-r--r-- |   1 | cgeng | domain | users | 87698 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.7.ark  |
| -rw-r--r-- |   1 | cgeng | domain | users |  1491 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.7.scp  |
| -rw-r--r-- |   1 | cgeng | domain | users | 73310 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.11.ark |
| -rw-r--r-- |   1 | cgeng | domain | users |  2270 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.11.scp |
| -rw-r--r-- |   1 | cgeng | domain | users | 59807 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.12.ark |
| -rw-r--r-- |   1 | cgeng | domain | users |  1503 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.12.scp |
| -rw-r--r-- |   1 | cgeng | domain | users | 62607 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.3.ark  |
| -rw-r--r-- |   1 | cgeng | domain | users |  1908 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.3.scp  |
| -rw-r--r-- |   1 | cgeng | domain | users | 70152 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.4.ark  |
| -rw-r--r-- |   1 | cgeng | domain | users |  1955 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.4.scp  |
| -rw-r--r-- |   1 | cgeng | domain | users | 66092 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.6.ark  |
| -rw-r--r-- |   1 | cgeng | domain | users |  1731 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.6.scp  |
| -rw-r--r-- |   1 | cgeng | domain | users | 64932 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.8.ark  |
| -rw-r--r-- |   1 | cgeng | domain | users |  1944 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.8.scp  |
| -rw-r--r-- |   1 | cgeng | domain | users | 61156 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.9.ark  |
| -rw-r--r-- |   1 | cgeng | domain | users |  1826 | Feb | 7 | 16:19 | vad_libri_dev_enrolls_cgeng.9.scp  |
3. xvectors erzeugen

#+begin_src  bash
ls /tmp/xvectors -l -R
#+end_src

#+RESULTS:
| /tmp/xvectors:                                      |     |       |        |       |       |     |   |       |                                  |
| total                                               |   4 |       |        |       |       |     |   |       |                                  |
| drwxr-xr-x                                          |   3 | cgeng | domain | users |  4096 | Feb | 7 | 16:21 | xvectors_libri_dev_enrolls_cgeng |
|                                                     |     |       |        |       |       |     |   |       |                                  |
| /tmp/xvectors/xvectors_libri_dev_enrolls_cgeng:     |     |       |        |       |       |     |   |       |                                  |
| total                                               | 872 |       |        |       |       |     |   |       |                                  |
| drwxr-xr-x                                          |   2 | cgeng | domain | users |  4096 | Feb | 7 | 16:21 | log                              |
| -rw-r--r--                                          |   1 | cgeng | domain | users |   246 | Feb | 7 | 16:21 | num_utts.ark                     |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 59822 | Feb | 7 | 16:21 | spk_xvector.ark                  |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2133 | Feb | 7 | 16:21 | spk_xvector.scp                  |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 66376 | Feb | 7 | 16:21 | xvector.10.ark                   |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2689 | Feb | 7 | 16:21 | xvector.10.scp                   |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 70550 | Feb | 7 | 16:21 | xvector.11.ark                   |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2883 | Feb | 7 | 16:21 | xvector.11.scp                   |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 47695 | Feb | 7 | 16:20 | xvector.12.ark                   |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  1918 | Feb | 7 | 16:20 | xvector.12.scp                   |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 53950 | Feb | 7 | 16:21 | xvector.1.ark                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2177 | Feb | 7 | 16:21 | xvector.1.scp                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 62243 | Feb | 7 | 16:21 | xvector.2.ark                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2506 | Feb | 7 | 16:21 | xvector.2.scp                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 60175 | Feb | 7 | 16:21 | xvector.3.ark                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2429 | Feb | 7 | 16:21 | xvector.3.scp                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 62232 | Feb | 7 | 16:21 | xvector.4.ark                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2495 | Feb | 7 | 16:21 | xvector.4.scp                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 64301 | Feb | 7 | 16:21 | xvector.5.ark                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2573 | Feb | 7 | 16:21 | xvector.5.scp                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 55980 | Feb | 7 | 16:21 | xvector.6.ark                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2216 | Feb | 7 | 16:21 | xvector.6.scp                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 47702 | Feb | 7 | 16:20 | xvector.7.ark                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  1902 | Feb | 7 | 16:20 | xvector.7.scp                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 62220 | Feb | 7 | 16:21 | xvector.8.ark                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2483 | Feb | 7 | 16:21 | xvector.8.scp                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 58084 | Feb | 7 | 16:21 | xvector.9.ark                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  2329 | Feb | 7 | 16:21 | xvector.9.scp                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 28600 | Feb | 7 | 16:21 | xvector.scp                      |
|                                                     |     |       |        |       |       |     |   |       |                                  |
| /tmp/xvectors/xvectors_libri_dev_enrolls_cgeng/log: |     |       |        |       |       |     |   |       |                                  |
| total                                               | 148 |       |        |       |       |     |   |       |                                  |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 10942 | Feb | 7 | 16:21 | extract.10.log                   |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 11349 | Feb | 7 | 16:21 | extract.11.log                   |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  9199 | Feb | 7 | 16:20 | extract.12.log                   |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  9801 | Feb | 7 | 16:21 | extract.1.log                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 10566 | Feb | 7 | 16:21 | extract.2.log                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 10372 | Feb | 7 | 16:21 | extract.3.log                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 10550 | Feb | 7 | 16:21 | extract.4.log                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 10742 | Feb | 7 | 16:21 | extract.5.log                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  9947 | Feb | 7 | 16:21 | extract.6.log                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  9196 | Feb | 7 | 16:20 | extract.7.log                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 10535 | Feb | 7 | 16:21 | extract.8.log                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users | 10168 | Feb | 7 | 16:21 | extract.9.log                    |
| -rw-r--r--                                          |   1 | cgeng | domain | users |  1126 | Feb | 7 | 16:21 | speaker_mean.log                 |








